FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_НастройкаЗарплатыСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТТ_НастройкаЗарплатыСервис</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТТ_СтавкиПоВидамРемонта</xr:Item>
				<xr:Item>InformationRegister.ТТ_ПараметрыЗП_Сервис</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Механики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АгрегатныйСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлесарныйСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТОСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПСОСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДОПСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пределы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Сервис</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предел</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ТТ_ПараметрыЗП_Сервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТ_ПараметрыЗП_Сервис</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТ_Параметры_ЗП_Сервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предел</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ТТ_СтавкиПоВидамРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТ_СтавкиПоВидамРемонта</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТТ_ВидыРемонтаДляЗП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ТТ_ВидыРемонтаДляЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТТ_ВидыРемонтаДляЗП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Слесарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Агрегатный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диспетчер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мастер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ТТ_НастройкаЗарплатыСервис/Ext/ObjectModule.bsl
Процедура ЗаполнитьПределы() Экспорт
	Пределы.Очистить();

	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Должность КАК Должность,
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Параметр,
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Предел,
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ТТ_ПараметрыЗП_Сервис.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗП_СервисСрезПоследних
	|ГДЕ
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Подразделение = &Подразделение
    |
	|УПОРЯДОЧИТЬ ПО
	|	Должность";
			Запрос.УстановитьПараметр("Подразделение",Подразделение);
			Запрос.УстановитьПараметр("Период",КонецДня(Дата));
			Рез=Запрос.Выполнить().Выбрать();
			Пока Рез.Следующий() Цикл
				Стр=Пределы.Добавить();
				Стр.Должность=Рез.Должность;
				Стр.Параметр=Рез.Параметр;
				Стр.Предел=Рез.Предел;
				Стр.Значение=Рез.Значение;
				
			КонецЦикла;	

	
КонецПроцедуры


Процедура ЗаполнитьМехаников() Экспорт
	
	Механики.Очистить();
	
	ЗапросСотр=Новый Запрос;
	ЗапросСотр.Текст="
	|ВЫБРАТЬ
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Должность,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.ВидРемонта,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Ставка
	|ИЗ
	|РегистрСведений.ТТ_СтавкиПоВидамРемонта.СрезПоследних(&Период, ) КАК ТТ_СтавкиПоВидамРемонтаСрезПоследних
	|ГДЕ
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Подразделение = &Подразделение
	|СГРУППИРОВАТЬ ПО
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Должность,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.ВидРемонта,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Ставка";
			ЗапросСотр.УстановитьПараметр("Подразделение",Подразделение);
			ЗапросСотр.УстановитьПараметр("Период",КонецДня(Дата));
			
			Должность="";
			НомерСтр=1;
			Стр="";
			ВыборкаСотр=ЗапросСотр.Выполнить().Выбрать();
			Пока ВыборкаСотр.Следующий() Цикл
				Если ВыборкаСотр.Должность=Должность Тогда
					//Стр=Механики.Получить(НомерСтр);

					Если ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный Тогда
						Стр.АгрегатныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный Тогда
						Стр.СлесарныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП Тогда
						Стр.ДОПСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО Тогда
						Стр.ПСОСтавка=ВыборкаСотр.Ставка;
					Иначе
						Стр.ТОСтавка=ВыборкаСотр.Ставка;
					КонецЕсли;	
				Иначе	
					Должность=ВыборкаСотр.Должность;
					Стр=Механики.Добавить();
					НомерСтр=Стр.НомерСтроки;
					Стр.Должность=ВыборкаСотр.Должность;
					Если ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный Тогда
						Стр.АгрегатныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный Тогда
						Стр.СлесарныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП Тогда
						Стр.ДОПСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО Тогда
						Стр.ПСОСтавка=ВыборкаСотр.Ставка;
					Иначе
						Стр.ТОСтавка=ВыборкаСотр.Ставка;
					КонецЕсли;	
	
				КонецЕсли;	
			КонецЦикла;	

		КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
			
	
	Движения.ТТ_ПараметрыЗП_Сервис.Записывать = Истина;
	Для Каждого Стр Из Пределы Цикл
		Движение = Движения.ТТ_ПараметрыЗП_Сервис.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.Параметр = Стр.Параметр;
		Движение.Предел = Стр.Предел; 
		Движение.Значение = Стр.Значение;
	КонецЦикла;

	Движения.ТТ_СтавкиПоВидамРемонта.Записывать = Истина;
	Для Каждого Стр Из Механики Цикл 
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный;
		Движение.Ставка = Стр.АгрегатныйСтавка; 
		
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный;
		Движение.Ставка = Стр.СлесарныйСтавка; 

		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП;
		Движение.Ставка = Стр.ДОПСтавка; 
		
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО;
		Движение.Ставка = Стр.ПСОСтавка; 
		
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.ТО;
		Движение.Ставка = Стр.ТОСтавка; 
		
	КонецЦикла;
	
	
	
КонецПроцедуры
